# AceleraDev Codenation - Semana 2

### Túlio Vieira de Souza | Data Scientist

## Manipulando Dados (Pré-Processamento)

#### 1. Importando as Bibliotecas Necessárias

In [1]:
#Importing libraries
import pandas as pd
import numpy as np

In [2]:
#Acessing the help from pandas (pd) package
pd?

#### 2. Manipulando Dicionários

In [3]:
#Creating a dictionary with data
dados = {'canal_venda' : ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
        'acessos': [100, 200, 300 ,400, 500],
        'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
        'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

In [8]:
#Showing the 'dados' dictionary created
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

In [9]:
#Checking the type from the variable 'dados'
type(dados)

dict

In [10]:
#Acessing the keys from the 'dados' dictionary
dados.keys()

dict_keys(['canal_venda', 'acessos', 'site', 'vendas'])

In [12]:
#Acessing a specific key in the 'dados' dictionary (In this case, the key 'site')
dados['site']

['site1', 'site1', 'site2', 'site2', 'site3']

In [13]:
#Acessing a specific position from a specific key in the 'dados' dictionary (In this case, the position 2)
dados['acessos'][2]

300

In [14]:
#Acessing another specific position from a specific key in the 'dados' dictionary (In this case, the position 3)
dados['canal_venda'][3]

'linkedin'

In [15]:
#Acessing a specific positions from a specific key in the 'dados' dictionary (In this case, the positions 0, 1, 2)
dados['canal_venda'][:3]

['facebook', 'twitter', 'instagram']

#### 3. Manipulando Listas

In [16]:
#Creating a list named 'lista'
lista = [200, 200, 300, 800, 200]

In [17]:
#Checking the type from the 'lista' variable
type([1,2,3])

list

In [18]:
#Showing the 'lista' list
lista

[200, 200, 300, 800, 200]

In [20]:
#Picking a specific value from the 'lista' list
lista[1]

200

In [21]:
#Picking a slice of values from the 'lista list
lista[:3]

[200, 200, 300]

In [22]:
#Adding the 'lista' list to the 'dados' dictionary
dados['lista'] = lista

In [24]:
#Showing the updated 'dados' dictionary
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [200, 200, 300, 800, 200]}

#### 4. Manipulando DataFrames

In [27]:
#Creating a dataframe named 'dataframe' from the 'dados' dictionary
dataframe = pd.DataFrame(dados)

In [28]:
#Showing the 'dataframe' dataframe
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [29]:
#Showing the 2 first rows from the 'dataframe' dataframe
dataframe.head(2)

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200

In [31]:
#Checking the format (number of rows and columns) from the 'dataframe' dataframe
dataframe.shape

(5, 5)

In [32]:
#Checking the index from the 'dataframe' dataframe
dataframe.index

RangeIndex(start=0, stop=5, step=1)

In [34]:
#Checking the types from the data columns presenting in the 'dataframe' dataframe
dataframe.dtypes

canal_venda     object
acessos          int64
site            object
vendas         float64
lista            int64
dtype: object

In [35]:
#Counting the types from the data columns presenting in the 'dataframe' dataframe
dataframe.dtypes.value_counts()

int64      2
object     2
float64    1
dtype: int64

In [37]:
#Checking for NaN (Not a Number) values in the 'dataframe' dataframe
dataframe.isna()

   canal_venda  acessos   site  vendas  lista
0        False    False  False   False  False
1        False    False  False   False  False
2        False    False  False   False  False
3        False    False  False   False  False
4        False    False  False   False  False

In [44]:
#Sum all the NaN (Not a Number) values in the columns from 'dataframe' dataframe
dataframe.isna().sum()

canal_venda    0
acessos        0
site           0
vendas         0
lista          0
nova_coluna    0
dtype: int64

In [38]:
#Showing the columns names from the 'dataframe' dataframe
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [39]:
#Showing a specific column from the 'dataframe' dataframe
dataframe['canal_venda']

0     facebook
1      twitter
2    instagram
3     linkedin
4     facebook
Name: canal_venda, dtype: object

In [55]:
#Creating and showing a new column in the 'dataframe' dataframe
dataframe['nova_coluna'] = [1, 2, 3, 4, 5]
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [56]:
#Showing the new columns names from the 'dataframe' dataframe
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista', 'nova_coluna'], dtype='object')

In [57]:
#Showing the 'dataframe' dataframe without some columns (In this case, the columns 'acessos', 'site', 'canal_venda)')
dataframe.drop(columns=['acessos', 'site', 'canal_venda'])

    vendas  lista  nova_coluna
0  1000.52    200            1
1  1052.34    200            2
2  2002.00    300            3
3  5000.00    800            4
4   300.00    200            5

In [58]:
#Removing the 'nova_coluna' column from the dataframe
dataframe.drop(columns='nova_coluna', inplace=True)
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [59]:
#Showing again the columns from the 'dataframe' dataframe
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [60]:
#Acessing a specific value from a specific column named 'acessos' in the 'dataframe' dataframe
dataframe['acessos'][1]

200

In [61]:
#Acessing a specific slice from a specific column named 'canal_venda' in the 'dataframe' datafrane
dataframe['canal_venda'][:2]

0    facebook
1     twitter
Name: canal_venda, dtype: object

In [63]:
#Slicing the data from 'dataframe' dataframe with iloc[rows, columns]
dataframe.iloc[3:,:]

  canal_venda  acessos   site  vendas  lista
3    linkedin      400  site2  5000.0    800
4    facebook      500  site3   300.0    200

In [65]:
#Slicing the data from 'dataframe' dataframe with the index loc[rows]
dataframe.loc[:2]

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300

In [66]:
#Showing specific columns from the 'dataframe' dataframe
dataframe[['canal_venda', 'vendas']]

  canal_venda   vendas
0    facebook  1000.52
1     twitter  1052.34
2   instagram  2002.00
3    linkedin  5000.00
4    facebook   300.00

In [67]:
#Passing a filter of the 'dataframe' dataframe in a list
filtro = ['canal_venda', 'acessos']

In [68]:
#Showing the 'dataframe' dataframe with the filter
dataframe[filtro]

  canal_venda  acessos
0    facebook      100
1     twitter      200
2   instagram      300
3    linkedin      400
4    facebook      500

In [69]:
#Using the info() method
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   canal_venda  5 non-null      object
 1   acessos      5 non-null      int64
 2   site         5 non-null      object
 3   vendas       5 non-null      float64
 4   lista        5 non-null      int64
dtypes: float64(1), int64(2), object(2)
memory usage: 328.0+ bytes

In [87]:
#Showing the default 'dataframe' dataframe
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [70]:
#Pivoting the data in 'dataframe' dataframe
aux = dataframe.pivot(index = 'canal_venda', columns='site', values='acessos')

In [71]:
#Using the info() method in the 'aux' dataframe
aux.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, facebook to twitter
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   site1   2 non-null      float64
 1   site2   2 non-null      float64
 2   site3   1 non-null      float64
dtypes: float64(3)
memory usage: 128.0+ bytes

In [107]:
#Completing the NaN values with the fillna method
#Pivoting the data from the 'aux' dataframe
aux = dataframe.pivot(index='canal_venda', columns='site', values='acessos').fillna(0)
dataframe.pivot(index='canal_venda', columns='site', values='acessos').fillna(0)

site         site1  site2  site3
canal_venda
facebook     100.0    0.0  500.0
instagram      0.0  300.0    0.0
linkedin       0.0  400.0    0.0
twitter      200.0    0.0    0.0

In [85]:
#Changing the columns using the melt() function
dataframe.melt(id_vars='site', value_vars=['canal_venda'])

    site     variable      value
0  site1  canal_venda   facebook
1  site1  canal_venda    twitter
2  site2  canal_venda  instagram
3  site2  canal_venda   linkedin
4  site3  canal_venda   facebook

In [109]:
#Reseting the index from the 'aux' dataframe
print(aux.columns)
aux = aux.reset_index()
print(aux.columns)

Index(['site1', 'site2', 'site3'], dtype='object', name='site')
Index(['canal_venda', 'site1', 'site2', 'site3'], dtype='object', name='site')

In [111]:
#Showing the new 'aux' dataframe
aux

site canal_venda  site1  site2  site3
0       facebook  100.0    0.0  500.0
1      instagram    0.0  300.0    0.0
2       linkedin    0.0  400.0    0.0
3        twitter  200.0    0.0    0.0

In [112]:
#Example of the melt() function
aux.melt(id_vars='canal_venda', value_vars=['site1', 'site2', 'site3'])

   canal_venda   site  value
0     facebook  site1  100.0
1    instagram  site1    0.0
2     linkedin  site1    0.0
3      twitter  site1  200.0
4     facebook  site2    0.0
5    instagram  site2  300.0
6     linkedin  site2  400.0
7      twitter  site2    0.0
8     facebook  site3  500.0
9    instagram  site3    0.0
10    linkedin  site3    0.0
11     twitter  site3    0.0

In [90]:
#Adding the columns from the 'dataframe' dataframe
dataframe.sum()

canal_venda    facebooktwitterinstagramlinkedinfacebook
acessos                                            1500
site                          site1site1site2site2site3
vendas                                          9354.86
lista                                              1700
dtype: object

In [91]:
#Adding the rows from the 'dataframe' dataframe
dataframe.sum(axis=1)

0    1300.52
1    1452.34
2    2602.00
3    6200.00
4    1000.00
dtype: float64

In [99]:
#Showing the 'dataframe' dataframe
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [100]:
#Calculating the median (mediana) of numeric columns in the 'dataframe' dataframe
print('Row:\n', dataframe.median(axis=1))
print('Column:\n', dataframe.median())

Row:
 0    200.0
1    200.0
2    300.0
3    800.0
4    300.0
dtype: float64
Column:
 acessos     300.00
vendas     1052.34
lista       200.00
dtype: float64

In [101]:
#Calculating the mean (média) of numeric columns in the 'dataframe' dataframe
dataframe.mean()

acessos     300.000
vendas     1870.972
lista       340.000
dtype: float64

In [102]:
#Calculating the standard deviation (desvio padrão) of numeric columns in the 'dataframe' dataframe
dataframe.std()

acessos     158.113883
vendas     1850.931024
lista       260.768096
dtype: float64

In [104]:
#Calculating the mode (moda) of numeric columns in the 'dataframe' dataframe
dataframe.mode()

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1   300.00  200.0
1         NaN      200  site2  1000.52    NaN
2         NaN      300    NaN  1052.34    NaN
3         NaN      400    NaN  2002.00    NaN
4         NaN      500    NaN  5000.00    NaN

In [103]:
#Calculating the descriptive statistics from the numeric columns in the 'dataframe' dataframe using describe()
dataframe.describe()

          acessos       vendas       lista
count    5.000000     5.000000    5.000000
mean   300.000000  1870.972000  340.000000
std    158.113883  1850.931024  260.768096
min    100.000000   300.000000  200.000000
25%    200.000000  1000.520000  200.000000
50%    300.000000  1052.340000  200.000000
75%    400.000000  2002.000000  300.000000
max    500.000000  5000.000000  800.000000

In [105]:
#Calculating the maximum (máximo) value from each numeric columns in the 'dataframe' dataframe
dataframe.max()

canal_venda    twitter
acessos            500
site             site3
vendas            5000
lista              800
dtype: object

In [215]:
#Calculating the minimum (mínimo) value from each numeric columns in the 'dataframe' dataframe
dataframe.min()

canal_venda    facebook
acessos             100
site              site1
vendas              300
lista               200
dtype: object

In [116]:
#Showing the unique values from a specific column from the 'dataframe' dataframe
dataframe['site'].unique()

array(['site1', 'site2', 'site3'], dtype=object)

In [117]:
#Showing the number of unique values from each column in the 'dataframe' dataframe
dataframe.nunique()

canal_venda    4
acessos        5
site           3
vendas         5
lista          3
dtype: int64

In [118]:
#Counting the unique values from a specific column from the 'dataframe' dataframe
dataframe['canal_venda'].value_counts()

facebook     2
instagram    1
twitter      1
linkedin     1
Name: canal_venda, dtype: int64

In [121]:
#Using groupby with the numeric values and sum
dataframe.groupby('site')['acessos'].sum()

site
site1    300
site2    700
site3    500
Name: acessos, dtype: int64

In [120]:
#Using groupby with the numeric values and median
dataframe.groupby('canal_venda')['acessos'].median()

canal_venda
facebook     300
instagram    300
linkedin     400
twitter      200
Name: acessos, dtype: int64

In [122]:
#Using groupby with categories values and unique
dataframe.groupby('site')['canal_venda'].unique()

site
site1      [facebook, twitter]
site2    [instagram, linkedin]
site3               [facebook]
Name: canal_venda, dtype: object

In [123]:
#Using groupy with categories values and first
dataframe.groupby('site')['canal_venda'].first()

site
site1     facebook
site2    instagram
site3     facebook
Name: canal_venda, dtype: object

In [125]:
#Using groupby with the aggregation function
dataframe.groupby('canal_venda').agg({'site':'unique', 'acessos':'sum'})

                       site  acessos
canal_venda
facebook     [site1, site3]      600
instagram           [site2]      300
linkedin            [site2]      400
twitter             [site1]      200

In [127]:
#Correlation between variables (features)
dataframe.corr(method='spearman')

         acessos    vendas     lista
acessos  1.00000  0.000000  0.335410
vendas   0.00000  1.000000  0.894427
lista    0.33541  0.894427  1.000000

In [128]:
#Showing the 'dataframe' dataframe
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [129]:
#Creating categorical variables by numeric variable slice
dataframe['categoria_vendas'] = pd.cut(dataframe['vendas'],
                                       bins= (0, 1500, 2000, 8000), 
                                       labels = ('0 a 1500', '1500 a 2000', '2000 a 8000'))
dataframe

  canal_venda  acessos   site   vendas  lista categoria_vendas
0    facebook      100  site1  1000.52    200         0 a 1500
1     twitter      200  site1  1052.34    200         0 a 1500
2   instagram      300  site2  2002.00    300      2000 a 8000
3    linkedin      400  site2  5000.00    800      2000 a 8000
4    facebook      500  site3   300.00    200         0 a 1500

In [131]:
#Creating categorical variable using list compression
dataframe['categoria_acessos'] = ['maior_que_300' if x > 300 else 'menor_que_300' for x in dataframe['acessos']]
dataframe

,canal_venda,acessos,site,vendas,lista,categoria_vendas,categoria_acessos
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300
1,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300
2,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300
3,linkedin,400,site2,5000.00,800,2000 a 8000,maior_que_300
4,facebook,500,site3,300.00,200,0 a 1500,maior_que_300

In [132]:
#Creating a second dataframe
dataframe_2 = pd.DataFrame({'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
               'suporte': ['Carlos', 'Carlos', 'Maria', 'Maria', 'Ezequiel']})

In [133]:
#Merging the two dataframes ('dataframe' and 'dataframe_2')
dataframe.merge(dataframe_2, on='site', how='left')

,canal_venda,acessos,site,vendas,lista,categoria_vendas,categoria_acessos,suporte
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300,Carlos
1,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300,Carlos
2,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300,Carlos
3,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300,Carlos
4,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300,Maria
5,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300,Maria
6,linkedin,400,site2,5000.00,800,2000 a 8000,maior_que_300,Maria
7,linkedin,400,site2,5000.00,800,2000 a 8000,maior_que_300,Maria
8,facebook,500,site3,300.00,200,0 a 1500,maior_que_300,Ezequiel

#### 5. Manipulando Arquivos .csv

In [134]:
#Saving the 'dataframe' dataframe as a .csv file
dataframe.to_csv('dataframe.csv', sep=';', decimal=',', index=False)

In [135]:
#Reading the .csv file and saving in the 'dataframe_lido' dataframe
dataframe_lido = pd.read_csv('dataframe.csv', sep=';', decimal=',')

In [136]:
#Showing the head from the 'dataframe_lido' dataframe
dataframe_lido.head()

,canal_venda,acessos,site,vendas,lista,categoria_vendas,categoria_acessos
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300
1,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300
2,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300
3,linkedin,400,site2,5000.00,800,2000 a 8000,maior_que_300
4,facebook,500,site3,300.00,200,0 a 1500,maior_que_300

In [144]:
#Reading the 'train.csv' file
df = pd.read_csv('train.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [145]:
#Creating a 'aux' dataframe with some characteristics from the 'train.csv' file 
aux = pd.DataFrame({'colunas': df.columns,
                    'tipos': df.dtypes,
                    'percentual_faltante': df.isna().sum() / df.shape[0]})
aux

                 colunas    tipos  percentual_faltante
PassengerId  PassengerId    int64             0.000000
Survived        Survived    int64             0.000000
Pclass            Pclass    int64             0.000000
Name                Name   object             0.000000
Sex                  Sex   object             0.000000
Age                  Age  float64             0.198653
SibSp              SibSp    int64             0.000000
Parch              Parch    int64             0.000000
Ticket            Ticket   object             0.000000
Fare                Fare  float64             0.000000
Cabin              Cabin   object             0.771044
Embarked        Embarked   object             0.002245

In [146]:
#Complete the NaN data on the numeric 'Age' column with the mode of the column
df['Age'] = df['Age'].fillna(df['Age'].mode())

In [147]:
#Complete the NaN data on the categorical 'Cabin' column with 'Unknown'
df['Cabin'] = df['Cabin'].fillna('Unknown')

In [149]:
#Showing the sum of values from the 'Cabin' column
df['Cabin'].value_counts()

Unknown        687
B96 B98          4
C23 C25 C27      4
G6               4
F33              3
              ...
E31              1
E34              1
A10              1
C62 C64          1
C104             1
Name: Cabin, Length: 148, dtype: int64

In [151]:
#Showing the number of rows and columns from the 'df' dataframe
df.shape

(891, 12)

#### 6. Manipulando Arquivos .json

In [138]:
json = pd.read_json('https://pricing.us-east-1.amazonaws.com/offers/v1.0/aws/index.json')

In [140]:
json.reset_index(inplace=True)

In [139]:
json['offers'][99]

{'offerCode': 'AmazonKinesisVideo',
 'versionIndexUrl': '/offers/v1.0/aws/AmazonKinesisVideo/index.json',
 'currentVersionUrl': '/offers/v1.0/aws/AmazonKinesisVideo/current/index.json',
 'currentRegionIndexUrl': '/offers/v1.0/aws/AmazonKinesisVideo/current/region_index.json'}

In [141]:
json['index']

0                    A4B
1             AWSAmplify
2             AWSAppSync
3              AWSBackup
4             AWSBudgets
             ...
149    comprehendmedical
150         datapipeline
151      mobileanalytics
152           transcribe
153            translate
Name: index, Length: 154, dtype: object